/Задачи/{  
    Users --> Messages (да може потребитела да си чете съобщенията като влезне в профила си)
    да превера на англииски предложение на потребителско име за регистрация
}


/ Направено/{

}


/Въпроси към Бако/{
    1. Имам повторение пак на кода в header-ра заради различките класове който използам при логнат потребител. Как да го направя?
    3. Users -> show
}


/Бъгове/{
    
}



/Поставени задачи от Бако/{
    // 1.Функция, която приема 2 параметъра - дума и текст .. и като резултат ти връща текста и ако думата съществува в него я обръща в главни букви
    // Пример: "vladi", "bako vladi obicha mnogo bira" трябва да ти върне "bako VLADI obicha mnogo bira"


    // 2.функция която връща колко дни остават до Нова Година


    // 3.функция - при подаден текст да ти връща брой гласни и съгласни в него


    // 4.функция която приема като параметър форматирани час, минути и секунди и ти връща с точност колко време остава до полунощ
    // Пример: подаваш "23:27:30" и ти връща че до полунощ остава "00:32:30"


    // 5.функция която при подадено число ти връща факториела на това число
    //Пример: 5 ->> Резултат: 5 * 4 * 3 * 2 * 1
    //Пример: 10 ->> Резултат: 10 * 9 * 8 * 7 * 6 * 5 * 4 * 3 * 2 * 1

    //6.Даден ви е масив с числа. Едно от тях се среща над половината пъти (тоест > 50%). Напишете програма, която намира това число.



    7.функция която приема един параметър int и връща близкото по-голями число 0 --> 0; 5 --> 10; 21 ---> 30;  20 _--> 20; (да се изпълнява от 0 до 1000)


    8.Hello How Are You --> hELLO hOW aRE yOU;


    9.функция която приема приема два масива и да ги сравни стойностите дали са еднакви и да върне (true, false);
    //www.freelancer.com
}
// 10мм стъкла за 325 литра аквариум --> към 150лв без доставката  // размери на аквариума 120/60/45 към 60кг. са стъклата




// Да се състави програма на Паскал за корегиране на едномерния масив А от 40 елемента,
// като всички отрицателни елементи се заменят с 2,всички положителни елементи увеличават стойността си с 3,
// а елементите с нулева стойност получат за стойност индексите си. Стойностите на масива А се задават от потребителя.


// http://zadachi-programirane.blogspot.com/


<a href="https://www.sinoptik.bg/vidin-bulgaria-100725905">
<img src="/uploads/images/DeepinScreenshot_select-area_20181212192208.png" style="width:284px; height: 77px;" alt="Image"/>
</a>